# Yosys synthesis script for O_SERDES_primitive_inst
# Read source files
read_verilog -sv ../../../../../yosys-rs-plugin/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog ./rtl/primitive_example_design_4.v


# Technology mapping
hierarchy -top primitive_example_design_4


plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay -no_iobuf -effort high -carry auto -new_tdp36k    -max_lut 45408 -max_reg 90816 -max_device_dsp 176 -max_device_bram 176 -max_device_carry_length 528 -max_dsp 176 -max_bram 176 -max_carry_length 528  -fsm_encoding onehot   -de_max_threads -1   

#plugin -i veriprune
#veri_prune
write_verilog -noexpr -nodec -v primitive_example_design_4_post_synth.v
write_blif -param primitive_example_design_4_post_synth.eblif