# Yosys synthesis script for O_SERDES_primitive_inst
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/01_25_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog primitive_example_design_1.v


# Technology mapping
hierarchy -top primitive_example_design_1


plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto -new_tdp36k    -max_lut 45408 -max_reg 90816 -max_device_dsp 176 -max_device_bram 176 -max_device_carry_length 528 -max_dsp 176 -max_bram 176 -max_carry_length 528  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -v post_synth1.v
write_blif -param O_SERDES_primitive_inst_post_synth.eblif